{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": {
    "type": "Replace",
    "pattern": {
      "Regex": "[^$;:,.!?¬°¬њвАФвА¶\"¬Ђ¬ї ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz…С…Р…Т√¶…У Щќ≤…Ф…Х√І…Ч…Ц√∞ §…Щ…Ш…Ъ…Ы…Ь…Э…Ю…Я Д…°…†…Ґ Ы…¶…ІƒІ…• Ь…®…™ Э…≠…ђ…Ђ…Ѓ Я…±…ѓ…∞≈Л…≥…≤…і√Є…µ…ЄќЄ≈У…ґ Ш…є…Ї…Њ…ї А Б…љ В Г И І Й К Лв±± М…£…§ НѕЗ О П С Р Т Ф ° Х Ґ«А«Б«В«ГЋИЋМЋРЋС Љ і ∞ ± ≤ ЈЋ†Ћ§ЋЮвЖУвЖСвЖТвЖЧвЖШ'ћ©бµї]"
    },
    "content": ""
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": ""
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "$",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "$",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "$": {
        "id": "$",
        "ids": [
          0
        ],
        "tokens": [
          "$"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "vocab": {
      "$": 0,
      ";": 1,
      ":": 2,
      ",": 3,
      ".": 4,
      "!": 5,
      "?": 6,
      "¬°": 7,
      "¬њ": 8,
      "вАФ": 9,
      "вА¶": 10,
      "\"": 15,
      "¬Ђ": 12,
      "¬ї": 13,
      " ": 16,
      "A": 17,
      "B": 18,
      "C": 19,
      "D": 20,
      "E": 21,
      "F": 22,
      "G": 23,
      "H": 24,
      "I": 25,
      "J": 26,
      "K": 27,
      "L": 28,
      "M": 29,
      "N": 30,
      "O": 31,
      "P": 32,
      "Q": 33,
      "R": 34,
      "S": 35,
      "T": 36,
      "U": 37,
      "V": 38,
      "W": 39,
      "X": 40,
      "Y": 41,
      "Z": 42,
      "a": 43,
      "b": 44,
      "c": 45,
      "d": 46,
      "e": 47,
      "f": 48,
      "g": 49,
      "h": 50,
      "i": 51,
      "j": 52,
      "k": 53,
      "l": 54,
      "m": 55,
      "n": 56,
      "o": 57,
      "p": 58,
      "q": 59,
      "r": 60,
      "s": 61,
      "t": 62,
      "u": 63,
      "v": 64,
      "w": 65,
      "x": 66,
      "y": 67,
      "z": 68,
      "…С": 69,
      "…Р": 70,
      "…Т": 71,
      "√¶": 72,
      "…У": 73,
      " Щ": 74,
      "ќ≤": 75,
      "…Ф": 76,
      "…Х": 77,
      "√І": 78,
      "…Ч": 79,
      "…Ц": 80,
      "√∞": 81,
      " §": 82,
      "…Щ": 83,
      "…Ш": 84,
      "…Ъ": 85,
      "…Ы": 86,
      "…Ь": 87,
      "…Э": 88,
      "…Ю": 89,
      "…Я": 90,
      " Д": 91,
      "…°": 92,
      "…†": 93,
      "…Ґ": 94,
      " Ы": 95,
      "…¶": 96,
      "…І": 97,
      "ƒІ": 98,
      "…•": 99,
      " Ь": 100,
      "…®": 101,
      "…™": 102,
      " Э": 103,
      "…≠": 104,
      "…ђ": 105,
      "…Ђ": 106,
      "…Ѓ": 107,
      " Я": 108,
      "…±": 109,
      "…ѓ": 110,
      "…∞": 111,
      "≈Л": 112,
      "…≥": 113,
      "…≤": 114,
      "…і": 115,
      "√Є": 116,
      "…µ": 117,
      "…Є": 118,
      "ќЄ": 119,
      "≈У": 120,
      "…ґ": 121,
      " Ш": 122,
      "…є": 123,
      "…Ї": 124,
      "…Њ": 125,
      "…ї": 126,
      " А": 127,
      " Б": 128,
      "…љ": 129,
      " В": 130,
      " Г": 131,
      " И": 132,
      " І": 133,
      " Й": 134,
      " К": 135,
      " Л": 136,
      "в±±": 137,
      " М": 138,
      "…£": 139,
      "…§": 140,
      " Н": 141,
      "ѕЗ": 142,
      " О": 143,
      " П": 144,
      " С": 145,
      " Р": 146,
      " Т": 147,
      " Ф": 148,
      " °": 149,
      " Х": 150,
      " Ґ": 151,
      "«А": 152,
      "«Б": 153,
      "«В": 154,
      "«Г": 155,
      "ЋИ": 156,
      "ЋМ": 157,
      "ЋР": 158,
      "ЋС": 159,
      " Љ": 160,
      " і": 161,
      " ∞": 162,
      " ±": 163,
      " ≤": 164,
      " Ј": 165,
      "Ћ†": 166,
      "Ћ§": 167,
      "ЋЮ": 168,
      "вЖУ": 169,
      "вЖС": 170,
      "вЖТ": 171,
      "вЖЧ": 172,
      "вЖШ": 173,
      "'": 176,
      "ћ©": 175,
      "бµї": 177
    }
  }
}
